//Lab_prog_1.cpp
#include "Lab_prog_header_1.h"
#include <windows.h>

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    system("mode con cols=120 lines=30");

    menu();
    
    // СДЕЛАТЬ
    //
    // Можно перевести то, что пользователь вводит в ООП структуры
    // 
    // DONE
    //
    // название файла не должно использовать недопустимые в винде символы
    // более юзерфрендли, лучше описать что пользователю надо делать, расширить инструкцию чтобы там был раздел как работать с программой, ее возможности и возможные ошибки и их решение
    // два скан ф в дате done
    // оставлять данных нет если пользователь не написал часть ячеек done
    //
    return 0;
}